ДоставкаЗаказов/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТрудоваяДеятельность</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеРаботы</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ДоставкаЗаказов/src/Catalogs/ФизическиеЛица/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
    КонецЕсли;
		
	ЭтоФамилияИмяОтчество(Отказ);
	ЭтоДатаРождения(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Процедура ЭтоФамилияИмяОтчество(Отказ)
	
	Если НЕ ((СтрПодобнаПоРегулярномуВыражению(Фамилия, "[А-Я]{1}[а-яё]+") ИЛИ
		СтрПодобнаПоРегулярномуВыражению(Фамилия, "[А-Я]{1}[а-яё]+[-]{1}[А-Я]{1}[а-яё]+")) И
		СтрПодобнаПоРегулярномуВыражению(Имя, "[А-Я]{1}[а-яё]+") И
		СтрПодобнаПоРегулярномуВыражению(Отчество, "[А-Я]{1}[а-яё]+")) Тогда
		
		Текст = "Поля Фамилия, Имя, Отчество должны быть
				|заполнены буквами русского алфавита и
				|начинаться с заглавной буквы";
		ОбщегоНазначенияВызовСервера.СообщитьПользователюСервер(Текст);
		Отказ = Истина;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура ЭтоДатаРождения(Отказ)
	
	Если ДатаРождения = Неопределено ИЛИ
		ДатаРождения = '0001.01.01' ИЛИ
		ДатаРождения > ТекущаяДатаСеанса() Тогда
		
		Текст = "Поле Дата рождения должно быть заполнено";
		ОбщегоНазначенияВызовСервера.СообщитьПользователюСервер(Текст);
		Отказ = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
